ossfauth/app/controllers/site_controller.rb

def regist
  if request.get?
    @site = Site.new
  elsif request.post?
    site = Site.new(:attributes => {
       :name =>params[:name],
       :ip   =>params[:ip]
       })
    site.regist_key = generate_regist_key
    site.save
    create_session_url = site.urls.new
    create_session_url.content = params[:create_session_url]
    create_session_url.action = 'create'
    create_session_url.save
---
INSERT INTO `sites` (`name`, `created_at`, `updated_at`, `regist_key`, `ip`) VALUES('test', '2010-01-17 23:53:44', '2010-01-17 23:53:44', '78a41300-e5f1-012c-c167-0011254f08ff', '1010')
INSERT INTO `urls` (`created_at`, `updated_at`, `action`, `content`, `site_id`) VALUES('2010-01-17 23:25:03', '2010-01-17 23:25:03', 'create', 'ccc', NULL)

  def fetch
    if request.post?
      s = Site.find_by_regist_key(params[:regist_key])
---
SELECT * FROM `sites` WHERE (`sites`.`regist_key` = '4cf9ec20-e6b5-012c-c16c-0011254f08ff') LIMIT 1