ossfauth/app/controllers/users_controller.rb

  def signup
    if request.post?
      u = User.create(:attributes => {
        :name => params[:name],
        :password => params[:password],
        :email => params[:email]
      })
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`, `password`, `email`) VALUES('tim', '2010-01-19 23:24:14', '2010-01-19 23:24:14', 'tim', 'test@xxx.cc')